mslawicz/ZB_strip_controller/STM32_WPAN/App/app_zigbee.c
/* ColorControl server step_color_xy 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_color_xy(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepColorXYReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 12 ColorControl server 1 step_color_xy 1 */
  APP_DBG("colorControl_server_1_step_color_xy");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 12 ColorControl server 1 step_color_xy 1 */
}

/* ColorControl server move_to_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 13 ColorControl server 1 move_to_color_temp 1 */
  APP_DBG("colorControl_server_1_move_to_color_temp, temp=%u, trans=%u", req->color_temp, req->transition_time);
  light_params.color_temp = req->color_temp;
  light_params.set_color_temp = true;
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 13 ColorControl server 1 move_to_color_temp 1 */
}

/* ColorControl server move_to_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 14 ColorControl server 1 move_to_hue_enh 1 */
  APP_DBG("colorControl_server_1_move_to_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 14 ColorControl server 1 move_to_hue_enh 1 */
}

/* ColorControl server move_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 15 ColorControl server 1 move_hue_enh 1 */
  APP_DBG("colorControl_server_1_move_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 15 ColorControl server 1 move_hue_enh 1 */
}

/* ColorControl server step_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 16 ColorControl server 1 step_hue_enh 1 */
  APP_DBG("colorControl_server_1_step_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 16 ColorControl server 1 step_hue_enh 1 */
}

/* ColorControl server move_to_hue_sat_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_hue_sat_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToHueSatEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 17 ColorControl server 1 move_to_hue_sat_enh 1 */
  APP_DBG("colorControl_server_1_move_to_hue_sat_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 17 ColorControl server 1 move_to_hue_sat_enh 1 */
}

/* ColorControl server color_loop_set 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_color_loop_set(struct ZbZclClusterT *cluster, struct ZbZclColorClientColorLoopSetReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 18 ColorControl server 1 color_loop_set 1 */
  APP_DBG("colorControl_server_1_color_loop_set, act=%u, dir=%u, hue=%u, trans=%u, flags=%u", req->action, req->direction, req->start_hue, req->transition_time, req->update_flags);
  if(req->action == 0)
  {
    /* loop off */
    light_params.color_restore = true;
  }
  else
  {
    /* loop on */
    light_params.loop_direction = req->direction;

    if(req->action == 1)
    {
      /* increment/decrement loop mode */
      if(light_params.loop_direction == 0)
      {
        /* decrement loop mode */
        light_params.color_loop_mode = (light_params.color_loop_mode > 0) ? light_params.color_loop_mode - 1 : COLOR_LOOP_NUMB_MODES - 1;
      }
      else
      {
        /* increment loop mode */
        light_params.color_loop_mode = (light_params.color_loop_mode < COLOR_LOOP_NUMB_MODES - 1) ? light_params.color_loop_mode + 1 : 0;
      }
    }
    else
    {
      /* set loop mode */
      if(req->start_hue > 0)
      {
        light_params.color_loop_mode = req->start_hue - 1;
      }
      else
      {
        /* hue == 0 means random mode */
        light_params.color_loop_mode = rand() % COLOR_LOOP_NUMB_MODES;
      }
    }

    light_params.color_mode = COLOR_LOOP;
  }
 
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 18 ColorControl server 1 color_loop_set 1 */
}

/* ColorControl server stop_move_step 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_stop_move_step(struct ZbZclClusterT *cluster, struct ZbZclColorClientStopMoveStepReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 19 ColorControl server 1 stop_move_step 1 */
  APP_DBG("colorControl_server_1_stop_move_step");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 19 ColorControl server 1 stop_move_step 1 */
}

/* ColorControl server move_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 20 ColorControl server 1 move_color_temp 1 */
  APP_DBG("colorControl_server_1_move_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 20 ColorControl server 1 move_color_temp 1 */
}

/* ColorControl server step_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 21 ColorControl server 1 step_color_temp 1 */
  APP_DBG("colorControl_server_1_step_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 21 ColorControl server 1 step_color_temp 1 */
}

/* LevelControl server move_to_level 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_move_to_level(struct ZbZclClusterT *cluster, struct ZbZclLevelClientMoveToLevelReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 22 LevelControl server 1 move_to_level 1 */
  APP_DBG("levelControl_server_1_move_to_level, level=%u, trans=%u, with_onoff=%u", req->level, req->transition_time, req->with_onoff);
  light_params.level_on = req->level;
  if(req->with_onoff)
  {
    light_params.level_target = light_params.level_on;
    light_params.transition_time = req->transition_time * 100;  /* conversion to milliseconds */
  }
  (void)ZbZclAttrIntegerWrite(cluster, ZCL_LEVEL_ATTR_CURRLEVEL, req->level);
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 22 LevelControl server 1 move_to_level 1 */
}

